DataProcessors/атл_ОтображениеТочекСТрекомНаКарте.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>атл_ОтображениеТочекСТрекомНаКарте</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТрека</Name>
					<Type>
						<v8:Type>cfg:EnumRef.атл_ВидыИсточниковКоординат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьТекущееМестонахождение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИнтерактивноеОткрытие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьТрек</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВводКоординаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодборСотрудника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьСтатусы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьКомментарии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокТочекЛиний</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Заголовок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Время</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цвет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Широта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Долгота</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Высота</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсточникКоординат</Name>
							<Comment>Источник координат</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.атл_ВидыИсточниковКоординат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скорость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Точность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаДляОтображения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СдвигВремениКоординаты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокСамостоятельныхТочек</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Заголовок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Время</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цвет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Широта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Долгота</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Высота</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсточникКоординат</Name>
							<Comment>Источник координат (0 - сеть, 1 - GPS)</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.атл_ВидыИсточниковКоординат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скорость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Точность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаДляОтображения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаТочки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьКоординаты</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипТочки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаДляОтображенияВКластере</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокПараметровОткрытия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:DocumentRef.атл_ЗадачаМобильномуСотруднику</v8:Type>
								<v8:Type>cfg:CatalogRef.атл_ПодразделенияКонтрагента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторИнформационнойБазы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Долгота</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Широта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаТочки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсточникКоординат</Name>
							<Type>
								<v8:Type>cfg:EnumRef.атл_ВидыИсточниковКоординат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Точность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1023</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/атл_ОтображениеТочекСТрекомНаКарте/Ext/ObjectModule.bsl
Функция hex(Знач Значение) 
	
    Значение=Число(Значение);
	
	Если Значение <= 0 Тогда 
		
        Результат = "0";
		
	Иначе
		
        Значение = Цел(Значение);
        Результат = "";
        Пока Значение > 0 Цикл
            Результат = Сред("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ",Значение%16 + 1,1)+Результат;
            Значение = Цел(Значение/16) ;
		КонецЦикла;
		
	КонецЕсли;
	
    Если СтрДлина(Результат) < 2 Тогда
    
        Результат = "0" + Результат;
    
	КонецЕсли; 
	
    Возврат "%" + Результат;
	
КонецФункции

Функция ПреобразоватьСимволы(URL)
    
    Результат = "";
    
    Для Сч = 1 По СтрДлина(URL) Цикл
        
        ch = Сред(URL,Сч,1);
        vch = КодСимвола(ch);
        
        Если ("A" <= ch ) И ( ch <= "Z") Тогда        // "A".."Z"
 
            Результат = Результат + ch;
			
        ИначеЕсли ("a" <= ch ) И ( ch <= "z") Тогда    // "a".."z"
 
            Результат = Результат + ch;
			
        ИначеЕсли ("0" <= ch ) И ( ch <= "9") Тогда    // "0".."9"
 
            Результат = Результат + ch;
			
        ИначеЕсли (ch = " ") ИЛИ ( ch = "+") Тогда            // space
 
            Результат = Результат + "+";
			
        ИначеЕсли (ch = "-" ) ИЛИ ( ch = "_") Тогда        // unreserved
 
            // ch == '.' || ch == '!'
 
            // ch == '~' || ch == '*'
 
            // ch == '\'' || ch == '('
 
            // ch == ')') Тогда
 
            Результат = Результат + ch;
			
        ИначеЕсли (vch <= 127) Тогда        // other ASCII
 
            Результат = Результат + hex(vch);
			
        ИначеЕсли (vch <= 2047) Тогда        // non-ASCII <= 0x7FF
 
            Результат = Результат + hex(192 + Цел(vch / 64));
            Результат = Результат + hex(128 + (vch % 64));
			
        Иначе                    // 0x7FF < ch <= 0xFFFF
 
            Результат = Результат + hex(224 + Цел(vch / 4096));
            Результат = Результат + hex(128 + (Цел(vch / 64) % 64));
            Результат = Результат + hex(128 + (vch % 64));
			
        КонецЕсли;
         
    КонецЦикла; 
    
    Возврат Результат;

КонецФункции // ()
 
Процедура ПоказатьТочкиНаКарте() Экспорт
	
	ЗаписьРегистра = РегистрыСведений.атл_НастройкиПодсистемыУМС.СоздатьМенеджерЗаписи();
	ЗаписьРегистра.Прочитать();
	АдресСсылки = ЗаписьРегистра.АдресКартыДляОтображенияТочек;
	Если НЕ ЗначениеЗаполнено(АдресСсылки) Тогда
		Сообщить("Не заполнен адрес карты для отображения точек! Отображение точек прервано!");
		Возврат;
	КонецЕсли;
	
	Ном = 0;
	
	Для Каждого Стр из СписокСамостоятельныхТочек Цикл
		
		Если ПустаяСтрока(Стр.Широта) И ПустаяСтрока(Стр.Долгота) Тогда
			Сообщить("Не заполнены координаты в строке " + Стр.НомерСтроки + "!", СтатусСообщения.Внимание);
			Продолжить;
		ИначеЕсли ПустаяСтрока(Стр.Широта) Или ПустаяСтрока(Стр.Долгота) Тогда
			Сообщить("Некорректно заполнены координаты в строке " + Стр.НомерСтроки + "!", СтатусСообщения.Внимание);
			Продолжить;
		КонецЕсли;
		
		НС = Строка(Ном);
		
		АдресСсылки = АдресСсылки + ?(Ном=0, "?latitude", "&latitude") + НС + "=" + СокрЛП(Стр.Широта) + 
					"&longitude" + НС + "=" + СокрЛП(Стр.Долгота) + 
					"&header" + НС + "=" + ПреобразоватьСимволы(СокрЛП(Стр.Заголовок)) +
				 	"&text" + НС + "=" + ПреобразоватьСимволы(СокрЛП(Стр.Текст)) + 
					"&time" + НС + "=" + ПреобразоватьСимволы(СокрЛП(Стр.Время)) + 
					"&color" + НС + "=" + СокрЛП(Стр.Цвет);
		
		Ном = Ном + 1;
	КонецЦикла;
	
	ФормаСтраницыОтображенияКоординат = ЭтотОбъект.ПолучитьФорму("ФормаОтображениеСтраницы");
	ФормаСтраницыОтображенияКоординат.ЭлементыФормы.ПолеHTMLДокумента1.Перейти(АдресСсылки);
	ФормаСтраницыОтображенияКоординат.Открыть();
	
КонецПроцедуры

Процедура ПоказатьТочкиСТрекомНаКарте() Экспорт
	
	//ЗаписьРегистра = РегистрыСведений.атл_НастройкиПодсистемыУМС.СоздатьМенеджерЗаписи();
	//ЗаписьРегистра.Прочитать();
	//АдресСсылки = ЗаписьРегистра.АдресКартыДляОтображенияТочек;
	//Если НЕ ЗначениеЗаполнено(АдресСсылки) Тогда
	//	Сообщить("Не заполнен адрес карты для отображения точек! Отображение точек прервано!");
	//	Возврат;
	//КонецЕсли;
	//
	//Ном = 0;
	//
	//Для Каждого Стр из СписокТочекЛиний Цикл
	//	
	//	Если ПустаяСтрока(Стр.Широта) И ПустаяСтрока(Стр.Долгота) Тогда
	//		Сообщить("Не заполнены координаты в строке " + Стр.НомерСтроки + "!", СтатусСообщения.Внимание);
	//		Продолжить;
	//	ИначеЕсли ПустаяСтрока(Стр.Широта) Или ПустаяСтрока(Стр.Долгота) Тогда
	//		Сообщить("Некорректно заполнены координаты в строке " + Стр.НомерСтроки + "!", СтатусСообщения.Внимание);
	//		Продолжить;
	//	КонецЕсли;
	//	
	//	НС = Строка(Ном);
	//	
	//	АдресСсылки = АдресСсылки + ?(Ном=0, "?latitude", "&latitude") + НС + "=" + СокрЛП(Стр.Широта) + 
	//				"&longitude" + НС + "=" + СокрЛП(Стр.Долгота) + 
	//				"&header" + НС + "=" + ПреобразоватьСимволы(СокрЛП(Стр.Заголовок)) +
	//			 	"&text" + НС + "=" + ПреобразоватьСимволы(СокрЛП(Стр.Текст)) + 
	//				"&time" + НС + "=" + ПреобразоватьСимволы(СокрЛП(Стр.Время)) + 
	//				"&color" + НС + "=" + СокрЛП(Стр.Цвет);
	//	
	//	Ном = Ном + 1;
	//КонецЦикла;
	
	ФормаСтраницыОтображенияКоординат = ЭтотОбъект.ПолучитьФорму("ФормаОтображениеСтраницы");
	//ФормаСтраницыОтображенияКоординат.ЭлементыФормы.ПолеHTMLДокумента1.Перейти(АдресСсылки);
	ФормаСтраницыОтображенияКоординат.ЭлементыФормы.ПолеHTMLДокумента1.Перейти("http://exchange.mobiforce.ru/adm/OpenLayers/examples/osm-ya.html");
	ФормаСтраницыОтображенияКоординат.Открыть();
	
КонецПроцедуры
